Revit 2026 API

# ElectricalSystemRemoveFromCircuit Method

---

remove a set of exist components from the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveFromCircuit(
	ElementSet components
)
```
```vb
Public Sub RemoveFromCircuit (
	components As ElementSet
)
```
```cpp
public:
void RemoveFromCircuit(
	ElementSet^ components
)
```
```fsharp
member RemoveFromCircuit :
        components : ElementSet -> unit
```

#### Parameters

components ElementSet
    The components removed from the electrical system.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the components parameter Value is . |
| InvalidOperationException | Thrown when the components cannot be removed from the system. |

If successful, all the components will remove from the system. Otherwise  is removed. This method will only function with the Autodesk Revit MEP application.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace